#include <d3d9.h>
#include "texture.h"
#include "sprite.h"

//=====================================================
//マクロ定義
//=====================================================
#define COCO_WALK_R_PATTERN_MAX (13)	//アニメーションのパターン数

//=====================================================
//グローバル変数
//=====================================================
static unsigned int g_Texture;

//=====================================================
//アニメーション初期化
//=====================================================
void PatternAnim_Init(void)
{
	
}

//=====================================================
//アニメーション描画
//=====================================================
void PatternAnim_Draw(unsigned int Tex, float dx, float dy, int frameCount)
{
	//再生したいアニメーション番号
	int pattern = frameCount / 4;

	//ココ右向き描画
	Sprite_Draw(Tex, dx, dy, pattern % 5 * 140, pattern / 5 * 200, 140, 200);
}